In [261]:
from pandas_datareader import data, wb
import pandas as pd
import yfinance as yf
yf.pdr_override()

In [8]:
type(BAC)

pandas.core.frame.DataFrame

In [15]:
BAC.to_csv('StockData/BAC.csv')

In [17]:
nasdaq_companylist = pd.read_csv('nasdaq_companylist.csv')

In [98]:
nasdaq_companylist['Symbol']

0         TXG
1          YI
2         PIH
3       PIHPP
4        TURN
        ...
3614       ZS
3615     ZUMZ
3616     ZYNE
3617     ZYXI
3618     ZNGA
Name: Symbol, Length: 3619, dtype: object

In [103]:
print(nasdaq_companylist[nasdaq_companylist['Symbol']=='AAPL'].index.values)

[246]

In [238]:
tickersOfInterest = pd.read_csv('tickersofinterest.csv')

In [239]:
tickersOfInterest.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23 entries, 0 to 22
Data columns (total 1 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   SYMBOLS  23 non-null     object
dtypes: object(1)
memory usage: 312.0+ bytes

In [259]:
tickersOfInterest.iloc[0].values[0]

'ASML'

In [277]:
tickerStr = []
for number in range(0,len(tickersOfInterest)):
    tickerStr.append(tickersOfInterest.iloc[number].values[0])

In [282]:
BAC.head()

                 Open       High        Low      Close  Adj Close    Volume
Date
2006-01-03  46.919998  47.180000  46.150002  47.080002  35.054218  16296700
2006-01-04  47.000000  47.240002  46.450001  46.580002  34.681938  17757900
2006-01-05  46.580002  46.830002  46.320000  46.639999  34.726604  14970700
2006-01-06  46.799999  46.910000  46.349998  46.570000  34.674480  12599800
2006-01-09  46.720001  46.970001  46.360001  46.599998  34.696808  15619400

In [278]:
BAC.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 3636 entries, 2006-01-03 to 2020-06-12
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Open       3636 non-null   float64
 1   High       3636 non-null   float64
 2   Low        3636 non-null   float64
 3   Close      3636 non-null   float64
 4   Adj Close  3636 non-null   float64
 5   Volume     3636 non-null   int64
dtypes: float64(5), int64(1)
memory usage: 198.8 KB

In [ ]:
def updateStockData():
    return data.get_data_yahoo(ticker_val, start, end)

In [308]:
BAC = data.get_data_yahoo('BAC', start_date, end_date)

[*********************100%***********************]  1 of 1 completed

In [309]:
BAC.to_csv('StockData/BAC.csv')

In [ ]:
BAC.info()

In [281]:
stockdata = pd.DataFrame({
    "Date" : [start_date],
    "Open" : [0],
    "High" : [0],
    "Low" : [0],
    "Close" : [0],
    "Adj Close" : [0],
    "Volume" : [0]
})

stockdata

         Date  Open  High  Low  Close  Adj Close  Volume
0  2006-01-01     0     0    0      0          0       0

In [299]:
df = pd.concat([stockdata,BAC],axis=0,keys = ['stockdata','BAC'])

In [300]:
BAC.head()

                 Open       High        Low      Close  Adj Close    Volume
Date
2006-01-03  46.919998  47.180000  46.150002  47.080002  35.054218  16296700
2006-01-04  47.000000  47.240002  46.450001  46.580002  34.681938  17757900
2006-01-05  46.580002  46.830002  46.320000  46.639999  34.726604  14970700
2006-01-06  46.799999  46.910000  46.349998  46.570000  34.674480  12599800
2006-01-09  46.720001  46.970001  46.360001  46.599998  34.696808  15619400

In [301]:
df

                                     Date       Open       High        Low  \
          Date
stockdata 0                    2006-01-01   0.000000   0.000000   0.000000
BAC       2006-01-03 00:00:00         NaN  46.919998  47.180000  46.150002
          2006-01-04 00:00:00         NaN  47.000000  47.240002  46.450001
          2006-01-05 00:00:00         NaN  46.580002  46.830002  46.320000
          2006-01-06 00:00:00         NaN  46.799999  46.910000  46.349998
...                                   ...        ...        ...        ...
          2020-06-08 00:00:00         NaN  28.590000  28.900000  28.139999
          2020-06-09 00:00:00         NaN  27.719999  28.540001  27.549999
          2020-06-10 00:00:00         NaN  27.969999  28.100000  26.510000
          2020-06-11 00:00:00         NaN  24.980000  25.690001  23.680000
          2020-06-12 00:00:00         NaN  25.030001  25.049999  24.040001

                                   Close  Adj Close     Volume
          Date
stockdata 0                     0.000000   0.000000          0
BAC       2006-01-03 00:00:00  47.080002  35.054218   16296700
          2006-01-04 00:00:00  46.580002  34.681938   17757900
          2006-01-05 00:00:00  46.639999  34.726604   14970700
          2006-01-06 00:00:00  46.570000  34.674480   12599800
...                                  ...        ...        ...
          2020-06-08 00:00:00  28.540001  28.540001   79598500
          2020-06-09 00:00:00  28.219999  28.219999   77773400
          2020-06-10 00:00:00  26.600000  26.600000   90415300
          2020-06-11 00:00:00  23.930000  23.930000  149875500
          2020-06-12 00:00:00  24.780001  24.780001   73678900

[3637 rows x 7 columns]

In [268]:
tickerStr

0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22

In [263]:
tickerStr

['ASML',
 'AAPL',
 'SOXL',
 'WMT',
 'MA',
 'MSFT',
 'NKE',
 'INTC',
 'BABA',
 'BYND',
 'BLK',
 'SKY',
 'GM',
 'AXP',
 'ARKK',
 'PYPL',
 'RY',
 'FCN',
 'ENPH',
 'NCLH',
 'RCL',
 'OVID',
 'LK']

In [315]:
a = {}
k = 0
while k < 10:
    key = k
    value = str(k) + 'Hi'
    a[key] = value 
    k += 1

In [316]:
a

{0: '0Hi',
 1: '1Hi',
 2: '2Hi',
 3: '3Hi',
 4: '4Hi',
 5: '5Hi',
 6: '6Hi',
 7: '7Hi',
 8: '8Hi',
 9: '9Hi'}

In [318]:
SOXL_df = data.get_data_yahoo('SOXL', start_date, end_date)

[*********************100%***********************]  1 of 1 completed